app/controllers/admin/account_departments_controller.rb

  def index
    @account_departments = AccountDepartment.all
---
SELECT * FROM `account_departments`