app/controllers/admin/clients_controller.rb

  def index
    @clients = Client.all
---
SELECT * FROM `clients`

  def show
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)

  def address_remote
  	@address = ClientAddress.new(params[:client_address])

	  respond_to do |format|
	  	if @address.save
---
INSERT INTO `client_addresses` (`address`, `city`, `created_at`, `title`, `district`, `zipcode`, `default`, `updated_at`, `client_id`, `state`) VALUES('2 modal', '2 modal', '2011-02-13 20:29:30', 'Title 2 modal', '2 modal', '2 modal', 0, '2011-02-13 20:29:30', 2, '2 modal')

  def address_remote_update
  	@address = ClientAddress.find(params[:id])
  	@address.update_attributes(params[:client_address])
---
SELECT * FROM `client_addresses` WHERE (`client_addresses`.`id` = 7)
UPDATE `client_addresses` SET `updated_at` = '2011-02-13 23:03:12', `title` = 'Title 7 modal alter' WHERE `id` = 7

  def create
    @client = Client.new(params[:client])

    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`name`, `observation`, `created_at`, `tel1`, `tel2`, `updated_at`, `contact`, `parent_id`) VALUES('Claudio', 'Sem observação', '2011-02-13 18:16:06', '11 80814290', '', '2011-02-13 18:16:06', 'Claudio', NULL)

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM `clients` WHERE (`clients`.`id` = 1)
UPDATE `clients` SET `updated_at` = '2011-02-13 18:16:19', `parent_id` = 1 WHERE `id` = 1