app/controllers/admin/client_addresses_controller.rb

SELECT * FROM `client_addresses`
---
  def index
    @client_addresses = ClientAddress.all

SELECT * FROM `client_addresses` WHERE (`client_addresses`.`id` = 7)
---
  def edit
    @client_address = ClientAddress.find(params[:id])

SELECT * FROM `client_addresses` WHERE (`client_addresses`.`id` = 1)
DELETE FROM `client_addresses` WHERE `id` = 1
---
  def destroy
    @client_address = ClientAddress.find(params[:id])
    @client_address.destroy