app/controllers/admin/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM `products`

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)

  def edit
    @product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)