app/controllers/admin/product_categories_controller.rb

SELECT * FROM `product_categories`
---
  def index
    @product_categories = ProductCategory.all

SELECT * FROM `product_categories` WHERE (`product_categories`.`id` = 1)
---
  def show
    @product_category = ProductCategory.find(params[:id])

SELECT * FROM `product_categories` WHERE (`product_categories`.`id` = 1)
---
  def edit
    @product_category = ProductCategory.find(params[:id])

INSERT INTO `product_categories` (`name`, `created_at`, `updated_at`, `description`) VALUES('Primeira categoria', '2011-02-13 17:11:37', '2011-02-13 17:11:37', 'Description primeira categoria')
---
  def create
    @product_category = ProductCategory.new(params[:product_category])

    respond_to do |format|
      if @product_category.save